Dataframe

#importing the libraries

In [1]:
import pandas as pd
import numpy as np

In [2]:
#using lists
student=[['Ram','Butwal',90],['Sita','Manigram',50],['Shishir','Tilottama 01',100]]
student

[['Ram', 'Butwal', 90],
 ['Sita', 'Manigram', 50],
 ['Shishir', 'Tilottama 01', 100]]

In [3]:
pd.DataFrame(student) #Creating Dataframe

         0             1    2
0      Ram        Butwal   90
1     Sita      Manigram   50
2  Shishir  Tilottama 01  100

In [4]:
stdDataframe=pd.DataFrame(student,columns=['Name','Address','Marks']) #To add column header

In [5]:
#Dictionary of student_detail
std_detail={
    'Name':['Shishir','Ram','David','Chirs','Bishal'],
    'Address':['Tilottama','Kathmandu','Uk','Canada','China'],
    'Marks':[50,60,70,50,30]
}
std_detail

{'Name': ['Shishir', 'Ram', 'David', 'Chirs', 'Bishal'],
 'Address': ['Tilottama', 'Kathmandu', 'Uk', 'Canada', 'China'],
 'Marks': [50, 60, 70, 50, 30]}

In [6]:
type(std_detail)

dict

In [7]:
std_detail_dataframe=pd.DataFrame(std_detail) #Creating dataframe using dictionary
std_detail_dataframe

      Name    Address  Marks
0  Shishir  Tilottama     50
1      Ram  Kathmandu     60
2    David         Uk     70
3    Chirs     Canada     50
4   Bishal      China     30

In [8]:
s={'Mark':50,'Name':'Shishir','Address':'Tilottama'}
s

{'Mark': 50, 'Name': 'Shishir', 'Address': 'Tilottama'}

In [9]:

# pd.DataFrame(s)

In [10]:
#To read csv file
movie_dataset=pd.read_csv('movies_updated.csv')
movie_dataset

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,"runtime,,"
0,The Shining,R,Drama,1980,"June 13, 1980 (United States)",8.4,927000,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000,46998772.0,Warner Bros.,"146.0,"
1,The Blue Lagoon,R,Adventure,1980,"July 2, 1980 (United States)",5.8,65000,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000,58853106.0,Columbia Pictures,"104.0,"
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980 (United States)",8.7,1200000,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000,538375067.0,Lucasfilm,"124.0,"
3,Airplane!,PG,Comedy,1980,"July 2, 1980 (United States)",7.7,221000,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000,83453539.0,Paramount Pictures,"88.0,"
4,Caddyshack,R,Comedy,1980,"July 25, 1980 (United States)",7.3,108000,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000,39846344.0,Orion Pictures,"98.0,"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3995,Birthday Girl,R,Comedy,2001,"February 1, 2002 (United States)",6.1,25000,Jez Butterworth,Tom Butterworth,Nicole Kidman,United Kingdom,13000000,16171098.0,FilmFour,"93.0,"
3996,Human Nature,R,Comedy,2001,"September 12, 2001 (France)",6.4,18000,Michel Gondry,Charlie Kaufman,Tim Robbins,France,0,1574660.0,Fine Line Features,"96.0,"
3997,Made,R,Comedy,2001,"August 31, 2001 (United States)",6.4,18000,Jon Favreau,Jon Favreau,Vince Vaughn,United States,5000000,5480653.0,Artisan Entertainment,"95.0,"
3998,One Night at McCool's,R,Comedy,2001,"April 27, 2001 (United States)",6.1,29000,Harald Zwart,Stan Seidel,Liv Tyler,United States,18000000,13578186.0,October Films,"93.0,"
3999,Dr. Dolittle 2,PG,Comedy,2001,"June 22, 2001 (United States)",4.7,42000,Steve Carr,Hugh Lofting,Eddie Murphy,United States,70000000,176104344.0,Twentieth Century Fox,"87.0,"

In [11]:
#shape
movie_dataset.shape #how many row and how many column

(4000, 15)

In [12]:
movie_dataset.dtypes #gives datatype

name          object
rating        object
genre         object
year           int64
released      object
score        float64
votes          int64
director      object
writer        object
star          object
country       object
budget         int64
gross        float64
company       object
runtime,,     object
dtype: object

In [13]:
movie_dataset.index #gives how many index are there

RangeIndex(start=0, stop=4000, step=1)

In [14]:
movie_dataset.values #gives the values data

array([['The Shining', 'R', 'Drama', ..., 46998772.0, 'Warner Bros.',
        '146.0,'],
       ['The Blue Lagoon', 'R', 'Adventure', ..., 58853106.0,
        'Columbia Pictures', '104.0,'],
       ['Star Wars: Episode V - The Empire Strikes Back', 'PG', 'Action',
        ..., 538375067.0, 'Lucasfilm', '124.0,'],
       ...,
       ['Made', 'R', 'Comedy', ..., 5480653.0, 'Artisan Entertainment',
        '95.0,'],
       ["One Night at McCool's", 'R', 'Comedy', ..., 13578186.0,
        'October Films', '93.0,'],
       ['Dr. Dolittle 2', 'PG', 'Comedy', ..., 176104344.0,
        'Twentieth Century Fox', '87.0,']], shape=(4000, 15), dtype=object)

In [15]:
movie_dataset.columns #to view column

Index(['name', 'rating', 'genre', 'year', 'released', 'score', 'votes',
       'director', 'writer', 'star', 'country', 'budget', 'gross', 'company',
       'runtime,,'],
      dtype='object')

In [16]:
#head and tail and sample
movie_dataset.head(3)

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,"runtime,,"
0,The Shining,R,Drama,1980,"June 13, 1980 (United States)",8.4,927000,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000,46998772.0,Warner Bros.,"146.0,"
1,The Blue Lagoon,R,Adventure,1980,"July 2, 1980 (United States)",5.8,65000,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000,58853106.0,Columbia Pictures,"104.0,"
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980 (United States)",8.7,1200000,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000,538375067.0,Lucasfilm,"124.0,"

In [17]:
movie_dataset.tail(4)

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,"runtime,,"
3996,Human Nature,R,Comedy,2001,"September 12, 2001 (France)",6.4,18000,Michel Gondry,Charlie Kaufman,Tim Robbins,France,0,1574660.0,Fine Line Features,"96.0,"
3997,Made,R,Comedy,2001,"August 31, 2001 (United States)",6.4,18000,Jon Favreau,Jon Favreau,Vince Vaughn,United States,5000000,5480653.0,Artisan Entertainment,"95.0,"
3998,One Night at McCool's,R,Comedy,2001,"April 27, 2001 (United States)",6.1,29000,Harald Zwart,Stan Seidel,Liv Tyler,United States,18000000,13578186.0,October Films,"93.0,"
3999,Dr. Dolittle 2,PG,Comedy,2001,"June 22, 2001 (United States)",4.7,42000,Steve Carr,Hugh Lofting,Eddie Murphy,United States,70000000,176104344.0,Twentieth Century Fox,"87.0,"

In [18]:
movie_dataset.sample(5)

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,"runtime,,"
3496,The Bone Collector,R,Crime,1999,"November 5, 1999 (United States)",6.7,159000,Phillip Noyce,Jeffery Deaver,Denzel Washington,United States,73000000,151493655.0,Columbia Pictures,"118.0,"
3864,Super Troopers,R,Comedy,2001,"February 15, 2002 (United States)",7.1,98000,Jay Chandrasekhar,Jay Chandrasekhar,Jay Chandrasekhar,United States,3000000,23182223.0,Fox Searchlight Pictures,"100.0,"
1884,The Commitments,R,Comedy,1991,"September 13, 1991 (United States)",7.6,34000,Alan Parker,Roddy Doyle,Robert Arkins,Ireland,12000000,14919570.0,Beacon Communications,"118.0,"
2942,Diabolique,R,Drama,1996,"March 22, 1996 (United States)",5.4,14000,Jeremiah S. Chechik,Pierre Boileau,Sharon Stone,United States,0,17100266.0,ABC Productions,"107.0,"
1145,Extreme Prejudice,R,Action,1987,"April 24, 1987 (United States)",6.6,6400,Walter Hill,John Milius,Nick Nolte,United States,22000000,11307844.0,Carolco Pictures,"104.0,"

In [19]:
movie_dataset.info() #gives all the information about data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 15 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       4000 non-null   object
 1   rating     3960 non-null   object
 2   genre      4000 non-null   object
 3   year       4000 non-null   int64
 4   released   4000 non-null   object
 5   score      4000 non-null   float64
 6   votes      4000 non-null   int64
 7   director   4000 non-null   object
 8   writer     3999 non-null   object
 9   star       3999 non-null   object
 10  country    4000 non-null   object
 11  budget     4000 non-null   int64
 12  gross      3831 non-null   float64
 13  company    3990 non-null   object
 14  runtime,,  4000 non-null   object
dtypes: float64(2), int64(3), object(10)
memory usage: 468.9+ KB

In [20]:
#describe
movie_dataset.describe() #gives all the necessary stats information

              year        score         votes        budget         gross
count  4000.000000  4000.000000  4.000000e+03  4.000000e+03  3.831000e+03
mean   1991.191500     6.321950  5.449450e+04  1.542740e+07  4.172202e+07
std       5.934529     0.977101  1.427738e+05  2.248639e+07  9.259504e+07
min    1980.000000     2.200000  5.100000e+01  0.000000e+00  3.090000e+02
25%    1986.000000     5.700000  4.300000e+03  0.000000e+00  2.835743e+06
50%    1991.000000     6.400000  1.300000e+04  7.000000e+06  1.183822e+07
75%    1996.000000     7.000000  4.500000e+04  2.100000e+07  3.560495e+07
max    2001.000000     9.300000  2.400000e+06  2.000000e+08  2.201647e+09

In [21]:
#is null
movie_dataset.isnull().sum() #how many null values are there 
#OR Use any one 
movie_dataset.isna().sum()

name           0
rating        40
genre          0
year           0
released       0
score          0
votes          0
director       0
writer         1
star           1
country        0
budget         0
gross        169
company       10
runtime,,      0
dtype: int64

In [22]:
movie_dataset.notnull().sum() #gives how many not null values are there

name         4000
rating       3960
genre        4000
year         4000
released     4000
score        4000
votes        4000
director     4000
writer       3999
star         3999
country      4000
budget       4000
gross        3831
company      3990
runtime,,    4000
dtype: int64

In [23]:
#duplicated
movie_dataset.duplicated().sum() # count how many duplicated row are there

np.int64(0)

In [24]:
#Dictionary of student_detail
std_detail={
    'Name':['Shishir','Ram','David','Chirs','Bishal','Bishal'],
    'Address':['Tilottama','Kathmandu','Uk','Canada','Uk','Uk'],
    'Marks':[50,60,70,50,0,0]
}
std_detail

{'Name': ['Shishir', 'Ram', 'David', 'Chirs', 'Bishal', 'Bishal'],
 'Address': ['Tilottama', 'Kathmandu', 'Uk', 'Canada', 'Uk', 'Uk'],
 'Marks': [50, 60, 70, 50, 0, 0]}

In [25]:
test=pd.DataFrame(std_detail)
test

      Name    Address  Marks
0  Shishir  Tilottama     50
1      Ram  Kathmandu     60
2    David         Uk     70
3    Chirs     Canada     50
4   Bishal         Uk      0
5   Bishal         Uk      0

In [26]:
test.duplicated().sum() #Whole row must be duplicated not just one value

np.int64(1)

In [27]:
#rename
test.rename(columns={'Name':'First Name','Marks':'Percentage'},inplace=True) #To rename column we use dictionary
#Inplace=True will change the original data in dataframe

In [28]:
#sum
test.sum() #Every column data will be added

First Name    ShishirRamDavidChirsBishalBishal
Address         TilottamaKathmanduUkCanadaUkUk
Percentage                                 230
dtype: object

In [29]:
test_values=[[10,20,50,60,70,8],[20,30,60,66,44,78],[74,56,58,44,10,56]]

In [30]:
test1=pd.DataFrame(test_values,columns=['one','Two','Three','Four','Five','Six'])
test1

   one  Two  Three  Four  Five  Six
0   10   20     50    60    70    8
1   20   30     60    66    44   78
2   74   56     58    44    10   56

In [31]:
test1.sum() #Column wise sum

one      104
Two      106
Three    168
Four     170
Five     124
Six      142
dtype: int64

In [32]:
test1.sum(axis=1) #Row wise sum

0    218
1    298
2    298
dtype: int64

In [33]:
test1.mean() #column wise mean

one      34.666667
Two      35.333333
Three    56.000000
Four     56.666667
Five     41.333333
Six      47.333333
dtype: float64

In [34]:
test1.mean(axis=1) #Row wise mean

0    36.333333
1    49.666667
2    49.666667
dtype: float64

In [35]:
test

  First Name    Address  Percentage
0    Shishir  Tilottama          50
1        Ram  Kathmandu          60
2      David         Uk          70
3      Chirs     Canada          50
4     Bishal         Uk           0
5     Bishal         Uk           0

In [36]:
test['First Name'] #To access any particular column data

0    Shishir
1        Ram
2      David
3      Chirs
4     Bishal
5     Bishal
Name: First Name, dtype: object

In [37]:
test[['First Name','Address']] #To access multiple column data

  First Name    Address
0    Shishir  Tilottama
1        Ram  Kathmandu
2      David         Uk
3      Chirs     Canada
4     Bishal         Uk
5     Bishal         Uk

In [38]:
movie_dataset.rename(columns={'name':'Movies_Name','rating':'Adult_Rating','score':'IMDB Score'},inplace=True)
movie_dataset

,Movies_Name,Adult_Rating,genre,year,released,IMDB Score,votes,director,writer,star,country,budget,gross,company,"runtime,,"
0,The Shining,R,Drama,1980,"June 13, 1980 (United States)",8.4,927000,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000,46998772.0,Warner Bros.,"146.0,"
1,The Blue Lagoon,R,Adventure,1980,"July 2, 1980 (United States)",5.8,65000,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000,58853106.0,Columbia Pictures,"104.0,"
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980 (United States)",8.7,1200000,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000,538375067.0,Lucasfilm,"124.0,"
3,Airplane!,PG,Comedy,1980,"July 2, 1980 (United States)",7.7,221000,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000,83453539.0,Paramount Pictures,"88.0,"
4,Caddyshack,R,Comedy,1980,"July 25, 1980 (United States)",7.3,108000,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000,39846344.0,Orion Pictures,"98.0,"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3995,Birthday Girl,R,Comedy,2001,"February 1, 2002 (United States)",6.1,25000,Jez Butterworth,Tom Butterworth,Nicole Kidman,United Kingdom,13000000,16171098.0,FilmFour,"93.0,"
3996,Human Nature,R,Comedy,2001,"September 12, 2001 (France)",6.4,18000,Michel Gondry,Charlie Kaufman,Tim Robbins,France,0,1574660.0,Fine Line Features,"96.0,"
3997,Made,R,Comedy,2001,"August 31, 2001 (United States)",6.4,18000,Jon Favreau,Jon Favreau,Vince Vaughn,United States,5000000,5480653.0,Artisan Entertainment,"95.0,"
3998,One Night at McCool's,R,Comedy,2001,"April 27, 2001 (United States)",6.1,29000,Harald Zwart,Stan Seidel,Liv Tyler,United States,18000000,13578186.0,October Films,"93.0,"
3999,Dr. Dolittle 2,PG,Comedy,2001,"June 22, 2001 (United States)",4.7,42000,Steve Carr,Hugh Lofting,Eddie Murphy,United States,70000000,176104344.0,Twentieth Century Fox,"87.0,"

In [39]:
test

  First Name    Address  Percentage
0    Shishir  Tilottama          50
1        Ram  Kathmandu          60
2      David         Uk          70
3      Chirs     Canada          50
4     Bishal         Uk           0
5     Bishal         Uk           0

In [40]:
test.iloc[0] #To access any particular index data we use iloc for indexing

First Name      Shishir
Address       Tilottama
Percentage           50
Name: 0, dtype: object

In [41]:
test.iloc[-1,1]

'Uk'

In [42]:
test.iloc[1:6,0:3:2] #[1:6,::2]

  First Name  Percentage
1        Ram          60
2      David          70
3      Chirs          50
4     Bishal           0
5     Bishal           0

In [43]:
test.loc[:3,'First Name':'Percentage'] #label indexing using loc

  First Name    Address  Percentage
0    Shishir  Tilottama          50
1        Ram  Kathmandu          60
2      David         Uk          70
3      Chirs     Canada          50

In [44]:
test.iloc[:3] #label indexing is not possible in iloc

  First Name    Address  Percentage
0    Shishir  Tilottama          50
1        Ram  Kathmandu          60
2      David         Uk          70

In [45]:
#set index
test

  First Name    Address  Percentage
0    Shishir  Tilottama          50
1        Ram  Kathmandu          60
2      David         Uk          70
3      Chirs     Canada          50
4     Bishal         Uk           0
5     Bishal         Uk           0

In [46]:
test.loc['Shishir']

KeyError: 'Shishir'

Filtering Dataframe

In [ ]:
#movies that release after 2000
num=movie_dataset[movie_dataset['year']>2000]

In [ ]:
#numer of movies released after 2000
num.Movies_Name.count()

np.int64(157)

In [ ]:
#Show all movies where rating is 'PG-13'
rating=movie_dataset[movie_dataset['Adult_Rating']=='PG-13'] #boolen indexing

In [ ]:
rating.Adult_Rating.count()

np.int64(848)

In [ ]:
#Movies where genre =comedy and rating ="PG"
rating1=movie_dataset[(movie_dataset['Adult_Rating']=='PG')& (movie_dataset['genre']=='Comedy')]
rating1.Movies_Name.count()

np.int64(346)

In [ ]:
#Top 10 movies by score
movie_dataset
movie_dataset.head(10).sort_values('IMDB Score')

,Movies_Name,Adult_Rating,genre,year,released,IMDB Score,votes,director,writer,star,country,budget,gross,company,"runtime,,"
1,The Blue Lagoon,R,Adventure,1980,"July 2, 1980 (United States)",5.8,65000,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000,58853106.0,Columbia Pictures,"104.0,"
5,Friday the 13th,R,Horror,1980,"May 9, 1980 (United States)",6.4,123000,Sean S. Cunningham,Victor Miller,Betsy Palmer,United States,550000,39754601.0,Paramount Pictures,"95.0,"
8,Superman II,PG,Action,1980,"June 19, 1981 (United States)",6.8,101000,Richard Lester,Jerry Siegel,Gene Hackman,United States,54000000,108185706.0,Dovemead Films,"127.0,"
9,The Long Riders,R,Biography,1980,"May 16, 1980 (United States)",7.0,10000,Walter Hill,Bill Bryden,David Carradine,United States,10000000,15795189.0,United Artists,"100.0,"
4,Caddyshack,R,Comedy,1980,"July 25, 1980 (United States)",7.3,108000,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000,39846344.0,Orion Pictures,"98.0,"
3,Airplane!,PG,Comedy,1980,"July 2, 1980 (United States)",7.7,221000,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000,83453539.0,Paramount Pictures,"88.0,"
6,The Blues Brothers,R,Action,1980,"June 20, 1980 (United States)",7.9,188000,John Landis,Dan Aykroyd,John Belushi,United States,27000000,115229890.0,Universal Pictures,"133.0,"
7,Raging Bull,R,Biography,1980,"December 19, 1980 (United States)",8.2,330000,Martin Scorsese,Jake LaMotta,Robert De Niro,United States,18000000,23402427.0,Chartoff-Winkler Productions,"129.0,"
0,The Shining,R,Drama,1980,"June 13, 1980 (United States)",8.4,927000,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000,46998772.0,Warner Bros.,"146.0,"
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980 (United States)",8.7,1200000,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000,538375067.0,Lucasfilm,"124.0,"

In [ ]:
#Top 5 drama movies by gross
movie_dataset.head(5).sort_values('gross')

,Movies_Name,Adult_Rating,genre,year,released,IMDB Score,votes,director,writer,star,country,budget,gross,company,"runtime,,"
4,Caddyshack,R,Comedy,1980,"July 25, 1980 (United States)",7.3,108000,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000,39846344.0,Orion Pictures,"98.0,"
0,The Shining,R,Drama,1980,"June 13, 1980 (United States)",8.4,927000,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000,46998772.0,Warner Bros.,"146.0,"
1,The Blue Lagoon,R,Adventure,1980,"July 2, 1980 (United States)",5.8,65000,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000,58853106.0,Columbia Pictures,"104.0,"
3,Airplane!,PG,Comedy,1980,"July 2, 1980 (United States)",7.7,221000,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000,83453539.0,Paramount Pictures,"88.0,"
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980 (United States)",8.7,1200000,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000,538375067.0,Lucasfilm,"124.0,"

In [ ]:
test_data=pd.DataFrame({
    'Name':['Shishir','Ram',np.nan,'Chirs','Bishal','Bishal'],
    'Address':['Tilottama','Kathmandu',np.nan,'Canada','Uk','Uk'],
    'Marks':[50,60,70,50,np.nan,0]
})
test_data

      Name    Address  Marks
0  Shishir  Tilottama   50.0
1      Ram  Kathmandu   60.0
2      NaN        NaN   70.0
3    Chirs     Canada   50.0
4   Bishal         Uk    NaN
5   Bishal         Uk    0.0

In [ ]:
test_data['Marks'].sort_values(na_position='first')

4     NaN
5     0.0
0    50.0
3    50.0
1    60.0
2    70.0
Name: Marks, dtype: float64

In [ ]:
test_data.sort_values('Marks')

      Name    Address  Marks
5   Bishal         Uk    0.0
0  Shishir  Tilottama   50.0
3    Chirs     Canada   50.0
1      Ram  Kathmandu   60.0
2      NaN        NaN   70.0
4   Bishal         Uk    NaN

In [ ]:
top10_movies=movie_dataset.sort_values('IMDB Score',ascending=False).head(10) #to sort values top 10
top10_movies[['Movies_Name','IMDB Score']] #accessing two column using indexing

                                            Movies_Name  IMDB Score
2443                           The Shawshank Redemption         9.3
2444                                       Pulp Fiction         8.9
2247                                   Schindler's List         8.9
2445                                       Forrest Gump         8.8
3444                                         Fight Club         8.8
3845  The Lord of the Rings: The Fellowship of the Ring         8.8
2        Star Wars: Episode V - The Empire Strikes Back         8.7
3443                                         The Matrix         8.7
1643                                         Goodfellas         8.7
3244                                Saving Private Ryan         8.6

In [ ]:
#top 5 drama movies by gross
# rating1=movie_dataset[(movie_dataset['Adult_Rating']=='PG')& (movie_dataset['genre']=='Comedy')]

top10_gross=movie_dataset[movie_dataset['genre']=='Drama'].sort_values('gross',ascending=False).head(5)

top10_gross[['Movies_Name','gross','year']]

              Movies_Name         gross  year
3045              Titanic  2.201647e+09  1997
2445         Forrest Gump  6.782261e+08  1994
3453      The Sixth Sense  6.728063e+08  1999
1648                Ghost  5.057036e+08  1990
3244  Saving Private Ryan  4.823496e+08  1998

In [ ]:
movie_dataset['genre'].value_counts() #to count the unique value in series

genre
Comedy       1355
Drama         807
Action        775
Crime         302
Adventure     231
Biography     175
Horror        158
Animation     113
Fantasy        33
Mystery        13
Thriller       11
Family          8
Romance         8
Sci-Fi          6
Western         3
Music           1
History         1
Name: count, dtype: int64

In [ ]:
movie_dataset['writer'].value_counts()

writer
Stephen King             27
John Hughes              24
Woody Allen              21
David Mamet              13
William Shakespeare      12
                         ..
Kimi Peck                 1
Adam Kennedy              1
John Cameron Mitchell     1
Gene Brewer               1
Tom Green                 1
Name: count, Length: 2685, dtype: int64

In [ ]:
#set index
test_data.set_index('Name',inplace=True)

In [ ]:
#reset index
#test_data.reset_index('Name',inplace=True)
test_data

              Name  Marks
Address
Tilottama  Shishir   50.0
Kathmandu      Ram   60.0
NaN            NaN   70.0
Canada       Chirs   50.0
Uk          Bishal    NaN
Uk          Bishal    0.0

In [ ]:
#replace existing index without loosing
test_data.reset_index(inplace=True)

In [ ]:
test_data

     Address     Name  Marks
0  Tilottama  Shishir   50.0
1  Kathmandu      Ram   60.0
2        NaN      NaN   70.0
3     Canada    Chirs   50.0
4         Uk   Bishal    NaN
5         Uk   Bishal    0.0

In [ ]:
test_data.set_index('Name',inplace=True)

In [ ]:
test_data

           Address  Marks
Name
Shishir  Tilottama   50.0
Ram      Kathmandu   60.0
NaN            NaN   70.0
Chirs       Canada   50.0
Bishal          Uk    NaN
Bishal          Uk    0.0

In [ ]:
test_data.reset_index(inplace=True)

In [ ]:
test_data

      Name    Address  Marks
0  Shishir  Tilottama   50.0
1      Ram  Kathmandu   60.0
2      NaN        NaN   70.0
3    Chirs     Canada   50.0
4   Bishal         Uk    NaN
5   Bishal         Uk    0.0

In [ ]:
#unique (Work only in series)
# movie_dataset['writer'].nunique().count() doesn't work because of array

In [ ]:
movie_dataset['writer'].nunique() #use this to count unique value

2685

In [ ]:
test_data['Marks'].nunique() #Doesn't count null value and 0 also

4

In [ ]:
test_data['Marks'].count() #null value doesn't count but 0 will be count

np.int64(5)

In [ ]:
test_data.isnull().sum() #count how many null are there

Name       1
Address    1
Marks      1
dtype: int64

In [ ]:
test_data.notnull().sum() #count how many not null value are there

Name       5
Address    5
Marks      5
dtype: int64

In [ ]:
#hasnans
test_data['Marks'].hasnans #check if the there is null value or not in the given series. it is an attribute not function

True

In [ ]:
#dropna
test_data.dropna() #null value row got dropped

      Name    Address  Marks
0  Shishir  Tilottama   50.0
1      Ram  Kathmandu   60.0
3    Chirs     Canada   50.0
5   Bishal         Uk    0.0

In [ ]:
test_data.dropna(axis=1) #drop column if there is any null data

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [ ]:
#fillna
test_data.fillna('unknown')

      Name    Address    Marks
0  Shishir  Tilottama     50.0
1      Ram  Kathmandu     60.0
2  unknown    unknown     70.0
3    Chirs     Canada     50.0
4   Bishal         Uk  unknown
5   Bishal         Uk      0.0

In [ ]:
#backward fill and forward fill
test_data.fillna(method='ffill')

C:\Users\shish\AppData\Local\Temp\ipykernel_24724\3813672950.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  test_data.fillna(method='ffill')

      Name    Address  Marks
0  Shishir  Tilottama   50.0
1      Ram  Kathmandu   60.0
2      Ram  Kathmandu   70.0
3    Chirs     Canada   50.0
4   Bishal         Uk   50.0
5   Bishal         Uk    0.0

In [ ]:
test_data.fillna(method='bfill') #fill from bottom to top eg: in 4th index marks was null value got filled by bottom value 0

C:\Users\shish\AppData\Local\Temp\ipykernel_24724\331947645.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  test_data.fillna(method='bfill')

      Name    Address  Marks
0  Shishir  Tilottama   50.0
1      Ram  Kathmandu   60.0
2    Chirs     Canada   70.0
3    Chirs     Canada   50.0
4   Bishal         Uk    0.0
5   Bishal         Uk    0.0

In [ ]:
a=test_data['Marks'].mean()
test_data['Marks'].fillna(a,inplace=True) #if i want to fill only in marks i will access first test_data['Marks]
test_data

      Name    Address  Marks
0  Shishir  Tilottama   50.0
1      Ram  Kathmandu   60.0
2      NaN        NaN   70.0
3    Chirs     Canada   50.0
4   Bishal         Uk   46.0
5   Bishal         Uk    0.0

In [ ]:
movie_dataset.columns

Index(['Movies_Name', 'Adult_Rating', 'genre', 'year', 'released',
       'IMDB Score', 'votes', 'director', 'writer', 'star', 'country',
       'budget', 'gross', 'company', 'runtime,,'],
      dtype='object')

In [ ]:
movie_dataset.isnull().sum()

Movies_Name       0
Adult_Rating     40
genre             0
year              0
released          0
IMDB Score        0
votes             0
director          0
writer            1
star              1
country           0
budget            0
gross           169
company          10
runtime,,         0
dtype: int64

In [ ]:
movie_dataset[['company','Adult_Rating']]=movie_dataset[['company','Adult_Rating']].fillna('unknown')
movie_dataset.isna().sum()

Movies_Name       0
Adult_Rating      0
genre             0
year              0
released          0
IMDB Score        0
votes             0
director          0
writer            1
star              1
country           0
budget            0
gross           169
company           0
runtime,,         0
dtype: int64

In [ ]:
movie_dataset['gross']=movie_dataset['gross'].fillna(movie_dataset['gross'].mean())

In [ ]:
movie_dataset.isna().sum()

Movies_Name     0
Adult_Rating    0
genre           0
year            0
released        0
IMDB Score      0
votes           0
director        0
writer          1
star            1
country         0
budget          0
gross           0
company         0
runtime,,       0
dtype: int64

In [ ]:
movie_dataset.dropna(inplace=True)
movie_dataset.isnull().sum()

Movies_Name     0
Adult_Rating    0
genre           0
year            0
released        0
IMDB Score      0
votes           0
director        0
writer          0
star            0
country         0
budget          0
gross           0
company         0
runtime,,       0
dtype: int64

GroupBy Objects in Panda

In [ ]:
movie_dataset.columns

Index(['Movies_Name', 'Adult_Rating', 'genre', 'year', 'released',
       'IMDB Score', 'votes', 'director', 'writer', 'star', 'country',
       'budget', 'gross', 'company', 'runtime,,'],
      dtype='object')

In [ ]:
movie_dataset['genre'].value_counts()

genre
Comedy       1355
Drama         806
Action        775
Crime         302
Adventure     231
Biography     175
Horror        158
Animation     113
Fantasy        33
Mystery        13
Thriller       11
Family          8
Romance         8
Sci-Fi          6
Western         3
Music           1
Name: count, dtype: int64

In [ ]:
genre=movie_dataset.groupby('genre')
genre

In [ ]:
#find the genre with highest avg score
genre['IMDB Score'].mean().sort_values(ascending=False).head(1) #First we grouped genre and checked the imdb score of the particular group and we checked the mean of each genre

genre
Music    7.2
Name: IMDB Score, dtype: float64

In [ ]:
#find the director with most numbers of vote
movie_dataset.columns

Index(['Movies_Name', 'Adult_Rating', 'genre', 'year', 'released',
       'IMDB Score', 'votes', 'director', 'writer', 'star', 'country',
       'budget', 'gross', 'company', 'runtime,,'],
      dtype='object')

In [ ]:
director=movie_dataset.groupby('director')

In [ ]:
director['votes'].sum().sort_values(ascending=False).head()

director
Steven Spielberg    7071000
Robert Zemeckis     5213000
David Fincher       4045000
James Cameron       3990000
Frank Darabont      3653000
Name: votes, dtype: int64

In [ ]:
genre.value_counts() #return the number of groups in objects

genre     Movies_Name                           Adult_Rating  year  released                           IMDB Score  votes  director             writer               star               country         budget    gross       company                                runtime,,
Action    15 Minutes                            R             2001  March 9, 2001 (United States)      6.1         49000  John Herzfeld        John Herzfeld        Robert De Niro     United States   60000000  56359980.0  New Line Cinema                        120.0,       1
          3 Ninjas                              PG            1992  August 7, 1992 (United States)     5.3         21000  Jon Turteltaub       Kenny Kim            Victor Wong        United States   6500000   29000301.0  Touchstone Pictures                    84.0,        1
          3 Ninjas Kick Back                    PG            1994  May 6, 1994 (United States)        4.6         8600   Charles T. Kanganis  Sang-ok Shin         Victor Wong        United States   20000000  11798854.0  Ben-Ami/Leeds Productions              93.0,        1
          3 Ninjas: High Noon at Mega Mountain  PG            1998  June 18, 1998 (Australia)          3.0         11000  Sean McNamara        Sean McNamara        Loni Anderson      United States   0         375805.0    Leeds/Ben-Ami Productions              93.0,        1
          3 Ninjas: Knuckle Up                  PG-13         1993  April 7, 1995 (United States)      4.3         5400   Sang-ok Shin         Alex S. Kim          Victor Wong        United States   0         413479.0    Sheen Productions                      85.0,        1
                                                                                                                                                                                                                                                                                ..
Thriller  The Seduction                         R             1982  January 29, 1982 (United States)   4.9         1100   David Schmoeller     David Schmoeller     Morgan Fairchild   United States   0         11378339.0  The Romantic Venture                   104.0,       1
          The Whistle Blower                    PG            1986  July 10, 1987 (United States)      6.2         2000   Simon Langton        Julian Bond          Michael Caine      United Kingdom  0         1500000.0   Portreeve                              100.0,       1
Western   Barbarosa                             PG            1982  February 19, 1982 (United States)  6.4         1500   Fred Schepisi        William D. Wittliff  Willie Nelson      United States   11000000  1736123.0   Incorporated Television Company (ITC)  90.0,        1
          Comin' at Ya!                         R             1981  July 24, 1981 (United States)      5.1         499    Ferdinando Baldi     Wolfe Lowenthal      Tony Anthony       Italy           0         12000000.0  Lupo-Anthony-Quintano Productions      91.0,        1
          Posse                                 R             1993  May 14, 1993 (United States)       5.5         4200   Mario Van Peebles    Sy Richardson        Mario Van Peebles  United Kingdom  10000000  18289763.0  PolyGram Filmed Entertainment          111.0,       1
Name: count, Length: 3998, dtype: int64

In [ ]:
genre.size() #return the number of data in each group

genre
Action        775
Adventure     231
Animation     113
Biography     175
Comedy       1355
Crime         302
Drama         806
Family          8
Fantasy        33
Horror        158
Music           1
Mystery        13
Romance         8
Sci-Fi          6
Thriller       11
Western         3
dtype: int64

In [ ]:
#First and last item of group by
genre.first() #first item of each group
genre.last() #last item of each group
genre.nth(5).set_index('genre')

,Movies_Name,Adult_Rating,year,released,IMDB Score,votes,director,writer,star,country,budget,gross,company,"runtime,,"
genre,,,,,,,,,,,,,,
Action,Raise the Titanic,PG,1980,"August 1, 1980 (United States)",5.0,4100,Jerry Jameson,Adam Kennedy,Jason Robards,United Kingdom,36000000,4.172202e+07,ITC Films,"115.0,"
Comedy,My Bodyguard,PG,1980,"September 26, 1980 (United States)",7.1,8900,Tony Bill,Alan Ormsby,Chris Makepeace,United States,0,2.248295e+07,Twentieth Century Fox,"102.0,"
Drama,Cattle Annie and Little Britches,PG,1980,"April 24, 1981 (United States)",6.1,604,Lamont Johnson,David Eyre,Scott Glenn,United States,5100000,5.348160e+05,Cattle Annie Productions,"97.0,"
Horror,The Boogey Man,R,1980,"November 7, 1980 (United States)",4.6,3900,Ulli Lommel,Ulli Lommel,Suzanna Love,United States,300000,4.172202e+07,The Jerry Gross Organization,"82.0,"
Biography,Can't Stop the Music,PG,1980,"June 20, 1980 (United States)",4.2,3700,Nancy Walker,Bronte Woodard,Ray Simpson,United States,20000000,4.172202e+07,EMI Films,"124.0,"
Adventure,The Last Flight of Noah's Ark,G,1980,"June 25, 1980 (United States)",5.8,1300,Charles Jarrott,Ernest K. Gann,Elliott Gould,United States,6000000,1.100000e+07,Walt Disney Productions,"97.0,"
Crime,Blow Out,R,1981,"July 24, 1981 (United States)",7.4,47000,Brian De Palma,Brian De Palma,John Travolta,United States,18000000,1.200000e+07,Filmways Pictures,"108.0,"
Animation,The Last Unicorn,G,1982,"November 19, 1982 (United States)",7.4,25000,Jules Bass,Peter S. Beagle,Jeff Bridges,United Kingdom,3500000,6.455330e+06,Rankin/Bass Productions,"92.0,"
Thriller,Lune de miel,R,1985,"November 20, 1985 (France)",4.6,100,Patrick Jamain,Robert Geoffrion,Nathalie Baye,France,0,4.172202e+07,Malofilm,"98.0,"
Fantasy,A Nightmare on Elm Street 3: Dream Warriors,R,1987,"February 27, 1987 (United States)",6.6,73000,Chuck Russell,Wes Craven,Heather Langenkamp,United States,4500000,4.479322e+07,New Line Cinema,"96.0,"
Sci-Fi,Hardware,R,1990,"September 14, 1990 (United States)",6.0,13000,Richard Stanley,Steve MacManus,Dylan McDermott,United Kingdom,1500000,5.728953e+06,Palace Pictures,"94.0,"
Mystery,Ruby Cairo,PG-13,1992,"October 29, 1993 (United States)",5.0,2100,Graeme Clifford,Robert Dillon,Andie MacDowell,United States,24000000,6.088660e+05,Majestic Films International,"90.0,"
Family,The Nutcracker,G,1993,"November 24, 1993 (United States)",5.9,1900,Emile Ardolino,Susan Cooper,Darci Kistler,United States,19000000,2.119994e+06,Krasnow Productions,"92.0,"
Romance,The Piano Player,Not Rated,1999,"October 21, 1999 (Germany)",7.8,7400,Rolf SchÃ¼bel,Ruth Toma,Joachim KrÃ³l,Germany,0,6.465320e+05,Studio Hamburg Filmproduktion,"112.0,"

In [ ]:
#get_group
genre.get_group('Romance')

,Movies_Name,Adult_Rating,genre,year,released,IMDB Score,votes,director,writer,star,country,budget,gross,company,"runtime,,"
156,Eye of the Needle,R,Romance,1981,"July 24, 1981 (United States)",7.1,9900,Richard Marquand,Ken Follett,Donald Sutherland,United Kingdom,0,1.758363e+07,Kings Road Entertainment,"112.0,"
521,Starman,PG,Romance,1984,"December 14, 1984 (United States)",7.0,44000,John Carpenter,Bruce A. Evans,Jeff Bridges,United States,22000000,2.874436e+07,Columbia Pictures,"115.0,"
1381,36 fillette,unknown,Romance,1988,"January 6, 1989 (United States)",6.0,1200,Catherine Breillat,Catherine Breillat,Delphine Zentout,France,0,4.172202e+07,CB Films,"88.0,"
2172,Love Crimes,R,Romance,1992,"January 24, 1992 (United States)",4.2,874,Lizzie Borden,Allan Moyle,Sean Young,United Kingdom,0,2.287928e+06,Sovereign Pictures,"90.0,"
3332,L'ennui,unknown,Romance,1998,"December 16, 1998 (France)",6.1,2000,CÃ©dric Kahn,CÃ©dric Kahn,Charles Berling,France,0,4.172202e+07,Gemini Films,"122.0,"
3616,The Piano Player,Not Rated,Romance,1999,"October 21, 1999 (Germany)",7.8,7400,Rolf SchÃ¼bel,Ruth Toma,Joachim KrÃ³l,Germany,0,6.465320e+05,Studio Hamburg Filmproduktion,"112.0,"
3820,The House of Mirth,PG,Romance,2000,"October 13, 2000 (United Kingdom)",7.0,7200,Terence Davies,Edith Wharton,Gillian Anderson,United Kingdom,10000000,5.164404e+06,Three Rivers Production,"135.0,"
3831,Love's Labour's Lost,PG,Romance,2000,"March 31, 2000 (United Kingdom)",6.0,4400,Kenneth Branagh,William Shakespeare,Alessandro Nivola,United Kingdom,13000000,2.997920e+05,PathÃ© Pictures International,"93.0,"

In [ ]:
genre.get_group('Sci-Fi')['Movies_Name']

59                              Hangar 18
299     Jekyll and Hyde... Together Again
323                           Kamikaze 89
390                            Brainstorm
942                 The Manhattan Project
1726                             Hardware
Name: Movies_Name, dtype: object

In [ ]:
#agg method multiple

genre[['IMDB Score','gross']].agg(['min','median','max','sum','count'])

          IMDB Score                                gross              \
                 min median  max     sum count        min      median
genre
Action           2.2   6.10  8.8  4661.6   775     2970.0  21756163.0
Adventure        2.6   6.20  8.5  1421.1   231    12712.0  17373527.0
Animation        4.2   6.90  8.6   777.8   113     5274.0  22510798.0
Biography        3.7   7.20  8.9  1234.1   175     2357.0  11135803.0
Comedy           2.7   6.20  8.6  8373.1  1355      309.0  12793213.0
Crime            4.0   6.60  8.9  2006.8   302     1605.0   9870640.0
Drama            2.7   6.70  9.3  5379.2   806      596.0   6298337.5
Family           5.9   6.40  7.8    52.4     8   781727.0   8910278.0
Fantasy          4.2   6.10  7.6   198.8    33   125397.0  17092453.0
Horror           2.9   5.75  8.1   907.6   158     2270.0  13103216.5
Music            7.2   7.20  7.2     7.2     1   110014.0    110014.0
Mystery          5.0   6.20  8.4    84.5    13   133645.0  18564088.0
Romance          4.2   6.55  7.8    51.2     8   299792.0  11374019.0
Sci-Fi           5.3   6.10  6.4    35.9     6    22440.0   4814476.5
Thriller         4.6   6.20  6.6    64.8    11   390659.0  11787127.0
Western          5.1   5.50  6.4    17.0     3  1736123.0  12000000.0


                    max           sum count
genre
Action     1.033928e+09  5.510478e+10   775
Adventure  1.006968e+09  1.101331e+10   231
Animation  1.083721e+09  1.117373e+10   113
Biography  3.221612e+08  5.376662e+09   175
Comedy     4.766847e+08  4.266205e+10  1355
Crime      4.507172e+08  8.992785e+09   302
Drama      2.201647e+09  2.536323e+10   806
Family     7.929106e+08  8.785744e+08     8
Fantasy    2.060715e+08  1.188490e+09    33
Horror     2.486391e+08  4.064977e+09   158
Music      1.100140e+05  1.100140e+05     1
Mystery    2.213032e+08  5.832960e+08    13
Romance    4.172202e+07  1.381707e+08     8
Sci-Fi     4.172202e+07  6.538506e+07     6
Thriller   4.492671e+07  2.087826e+08    11
Western    1.828976e+07  3.202589e+07     3

In [ ]:
genre.agg({'IMDB Score':['mean','median'],
           'gross':'sum'})

          IMDB Score                gross
                mean median           sum
genre
Action      6.014968   6.10  5.510478e+10
Adventure   6.151948   6.20  1.101331e+10
Animation   6.883186   6.90  1.117373e+10
Biography   7.052000   7.20  5.376662e+09
Comedy      6.179410   6.20  4.266205e+10
Crime       6.645033   6.60  8.992785e+09
Drama       6.673945   6.70  2.536323e+10
Family      6.550000   6.40  8.785744e+08
Fantasy     6.024242   6.10  1.188490e+09
Horror      5.744304   5.75  4.064977e+09
Music       7.200000   7.20  1.100140e+05
Mystery     6.500000   6.20  5.832960e+08
Romance     6.400000   6.55  1.381707e+08
Sci-Fi      5.983333   6.10  6.538506e+07
Thriller    5.890909   6.20  2.087826e+08
Western     5.666667   5.50  3.202589e+07